�שה להוספת תכונהאיכות הקרנה של כרטיסייה/מסךגילוי מכשיריםאחרקופאקופצנילא יציבחלקהמושלםלא ניתן לצפייהאיכות גרועהסביר‏טוב – DVD‏מעולה – HDלא ברור‏סביר – FMאיכות טובההמשוב מיד יישלח…לא ניתן לשלוח משוב. ניתן לנסות שוב מאוחר יותר.תודה ששלחת משוב.שליחת המשוב נכשלה. מתבצע ניסיון נוסף…יומני העברה ומכשירים‏אזהרה - הרישום המפורט פועל. יומני הרישום שבהמשך עשויים לכלול כתובות URL או מידע רגיש אחר. יש לעיין בהם כדי לוודא שאין לך בעיה לשלוח את המידע הזה.שליחת <a href="">
    יומני ניפוי באגים</a> (מומלץ)שליחת יומני ניפוי באגים (מומלץ)‏נתונים על גרסת Chrome, גרסת מערכת ההפעלה, הגדרות ההעברה (Cast),
    נתונים סטטיסטיים של ביצועי שיקוף מסך ויומני אבחון של ערוץ
    התקשורת שלך, יישלחו יחד עם כל מידע אחר שהגדרתך
    תכלול למעלה. משוב זה משמש לאבחון בעיות
    וכדי לעזור בשיפור התכונה. כל המידע האישי שיישלח
    במפורש או באופן מקרי יהיה מוגן בהתאם
    למדינ�